spec/cassettes/StripeWrapper_Charge/with_valid_card/charges_the_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=3&card[exp_year]=2016&card[cvc]=123
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_YV1EUbqpz4DkpQWUBCFkUkAH
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        robins-MacBook-Pro.local 12.3.0 Darwin Kernel Version 12.3.0: Sun Jan  6 22:37:10
        PST 2013; root:xnu-2050.22.13~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 06 Jul 2013 18:21:21 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '495'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"tok_29IvaXyWJT2JEI\",\n  \"livemode\": false,\n  \"created\":
        1373134881,\n  \"used\": false,\n  \"object\": \"token\",\n  \"type\": \"card\",\n
        \ \"card\": {\n    \"object\": \"card\",\n    \"last4\": \"4242\",\n    \"type\":
        \"Visa\",\n    \"exp_month\": 3,\n    \"exp_year\": 2016,\n    \"fingerprint\":
        \"xwCASUqYHor1nh1B\",\n    \"country\": \"US\",\n    \"name\": null,\n    \"address_line1\":
        null,\n    \"address_line2\": null,\n    \"address_city\": null,\n    \"address_state\":
        null,\n    \"address_zip\": null,\n    \"address_country\": null\n  }\n}\n"
    http_version: 
  recorded_at: Sat, 06 Jul 2013 18:21:22 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=400&currency=usd&card=tok_29IvaXyWJT2JEI
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_YV1EUbqpz4DkpQWUBCFkUkAH
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        robins-MacBook-Pro.local 12.3.0 Darwin Kernel Version 12.3.0: Sun Jan  6 22:37:10
        PST 2013; root:xnu-2050.22.13~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '47'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 06 Jul 2013 18:21:22 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1023'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"ch_29IvqzioJAIGt4\",\n  \"object\": \"charge\",\n
        \ \"created\": 1373134882,\n  \"livemode\": false,\n  \"paid\": true,\n  \"amount\":
        400,\n  \"currency\": \"usd\",\n  \"refunded\": false,\n  \"fee\": 42,\n  \"fee_details\":
        [\n    {\n      \"amount\": 42,\n      \"currency\": \"usd\",\n      \"type\":
        \"stripe_fee\",\n      \"description\": \"Stripe processing fees\",\n      \"application\":
        null,\n      \"amount_refunded\": 0\n    }\n  ],\n  \"card\": {\n    \"object\":
        \"card\",\n    \"last4\": \"4242\",\n    \"type\": \"Visa\",\n    \"exp_month\":
        3,\n    \"exp_year\": 2016,\n    \"fingerprint\": \"xwCASUqYHor1nh1B\",\n
        \   \"country\": \"US\",\n    \"name\": null,\n    \"address_line1\": null,\n
        \   \"address_line2\": null,\n    \"address_city\": null,\n    \"address_state\":
        null,\n    \"address_zip\": null,\n    \"address_country\": null,\n    \"cvc_check\":
        \"pass\",\n    \"address_line1_check\": null,\n    \"address_zip_check\":
        null\n  },\n  \"captured\": true,\n  \"failure_message\": null,\n  \"failure_code\":
        null,\n  \"amount_refunded\": 0,\n  \"customer\": null,\n  \"invoice\": null,\n
        \ \"description\": null,\n  \"dispute\": null\n}\n"
    http_version: 
  recorded_at: Sat, 06 Jul 2013 18:21:24 GMT
recorded_with: VCR 2.5.0
